#include <iostream>
#include <math.h>
#include <stdio.h>
#include <locale.h>
#include <Windows.h>
#include <conio.h>
#include <time.h>
using namespace std;

void main()
{
start:
	system("cls");
	setlocale(LC_ALL, "Rus");
	int nz;
	cout << "Введите номер задания : ";
	cin >> nz;
	switch (nz)
	{

	case 1:

	{
		system("cls");
		cout << "первое  задание" << endl;
		cout << "__________________________________________________________________________________" << endl;
		int h, m, sek, s;
		cout << "Введите сколько часов прошло с начла дня : ";
		cin >> h;
		cout << "__________________________________________________________________________________" << endl;
		cout << "Введите сколько минут прошло с начла дня : ";

		cin >> m;
		cout << "__________________________________________________________________________________" << endl;
		if (m < 60)
		{
			cout << "Введите сколько секунд прошло с начла дня : ";
			cin >> sek;
			cout << "__________________________________________________________________________________" << endl;
			s = h * 3600 + m * 60 + sek;
			cout << "__________________________________________________________________________________" << endl;
			cout << "               C начла дня прошло " << s << " секунд" << endl;
			cout << "__________________________________________________________________________________" << endl;
		}
		else
		{
			cout << "Введите кол-во минут от 1 до 60 " << endl;
		}
	}

	case 2:

	{
		system("cls");
		cout << "Второе  задание" << endl;
		cout << "__________________________________________________________________________________" << endl;
		cout << " Напишите четыре цифры например, принимается число 7631, возвращается число 1367 " << endl;
		cout << "__________________________________________________________________________________" << endl;
		int n, m = 0;
		cout << "Введите целое число: ";
		cin >> n;
		cout << "__________________________________________________________________________________" << endl;
		while (n != 0)
		{
			m *= 10;
			m += n % 10;
			n = n / 10;
		}
		cout << "Число в обратном порядке: " << m << endl;
		cout << "__________________________________________________________________________________" << endl;
		cout << " *** Нажмите любую клавишу чтоб начать задания " << endl;
		cout << "__________________________________________________________________________________" << endl;
		system("pause");
		goto start;
		break;
	}

	case 3:

	{
		char Stroka[150] = { 0 };
		int a, z = 0, bc;
		bool Palindrom = true;
		system("cls");
		cout << "третье задание" << endl;
		cout << "__________________________________________________________________________________" << endl;
		cout << "Введите число: ";
		cout << "__________________________________________________________________________________" << endl;
		cin >> Stroka;
		while (Stroka[z])
			z++;
		a = (int)(z / 2);
		for (bc = 0; bc < a; bc++)
		{
			if (Stroka[bc] != Stroka[z - bc - 1])
			{
				Palindrom = false;
				break;
			}
		}
		if (Palindrom)
		{
			cout << "Число " << Stroka << " - палиндром.\n";
			cout << "__________________________________________________________________________________" << endl;
		}
		else
		{
			cout << "Число " << Stroka << " - палиндром.\n";
			cout << "__________________________________________________________________________________" << endl;
		}
		system("pause");
		goto start;
		break;
	}

	case 4:

	{
		bool f(int n);
		bool f1(int n);
		system("cls");
		cout << "четвертое задание" << endl;
		cout << "__________________________________________________________________________________" << endl;
		int i, c, sum;
		cout << endl << "Введите число: ";
		cin >> c;
		cout << "__________________________________________________________________________________" << endl;
		sum = 0;
		int b;
		for (i = 1; i<c; i++)
		{
			if (c%i == 0)
			{
				sum = sum + i;
			}
		}
		if (c == sum)
		{
			cout << endl << "Число совершенное!";
			cout << "__________________________________________________________________________________" << endl;
		}
		else
		{
			cout << endl << "Число НЕ является совершенным";
			cout << "__________________________________________________________________________________" << endl;
		}

		cout << endl << endl << "Все совершенные чисел от 1 до 1000:" << endl;
		cout << "__________________________________________________________________________________" << endl;
		for (i = 1; i<1001; i++)
		{
			b = i;
		}

		system("pause");
		goto start;
		break;
	}


	case 5:

	{
		system("cls");
		cout << "пятое задание" << endl;
		cout << "__________________________________________________________________________________" << endl;
		int srand(time(NULL));
		srand = 1 + (srand) % 5;
		cout << srand << " - ";
		switch (srand)
		{
		case 1:
			cout << "Ужасно!" << endl;
			cout << "__________________________________________________________________________________" << endl;
			break;
		case 2:
			cout << "Неуд!" << endl;
			cout << "__________________________________________________________________________________" << endl;
			break;
		case 3:
			cout << "Удовл" << endl;
			cout << "__________________________________________________________________________________" << endl;
			break;
		case 4:
			cout << "Хорошо" << endl;
			cout << "__________________________________________________________________________________" << endl;
			break;
		case 5:
			cout << "Отлично" << endl;
			cout << "__________________________________________________________________________________" << endl;
			break;
		}
		system("pause");
		goto start;
		break;
	}

	case 6:

	{
		system("cls");
		cout << "6 задание" << endl;
		cout << "__________________________________________________________________________________" << endl;
		int a, a10, a60;
		cout << "Введите число: ";
		scanf("%d", &a);

		a60 = a / 60;
		a = a % 60;
		a10 = a / 10;
		a = a % 10;

		if (a > 8) {
			a = 0;
			a10++;
		}

		if (a10 > 3) {
			a10 = 0;
			a60++;
		}



		printf("%d %d %d", a, a10, a60);
		system("pause");
		goto start;
		break;
	}

	case 7:

	{
		system("cls");
		cout << "седьмое задание" << endl;
		cout << "__________________________________________________________________________________" << endl;
		int n;
		cout << "Введите число: ";
		std::cin >> n;
		cout << "__________________________________________________________________________________" << endl;

		int out[5] = {};
		out[4] = n / 60;
		n %= 60;
		int a[4] = { 20, 10, 5, 1 };
		int s[4] = { 230, 125, 70, 15 };
		int temp[4] = {};
		int sum = 0;
		for (int i = 0; i < 4; ++i)
			if (n / a[i] != 0) {
				temp[3 - i] = n / a[i];
				sum += temp[3 - i] * s[i];
				n %= a[i];
			}
		if (sum >= 440)
			++out[4];
		else
			for (int i = 0; i < 4; ++i)
				out[i] = temp[i];

		for (int i = 0; i < 5; ++i)
			std::cout << out[i] << ' ';
		std::cout << std::endl;
		system("pause");
		goto start;
		break;
	}

	default:
		system("cls");
		cout << " Такого задания нету  " << endl;
		cout << " Нажмите любую кнопку  " << endl;
		system("pause");
		goto start;
		break;
	}
}
